{
  "format": "layers-model",
  "generatedBy": "TensorFlow.js tfjs-layers v4.22.0",
  "convertedBy": null,
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "sequential_1",
      "layers": [
        {
          "class_name": "Embedding",
          "config": {
            "input_dim": 10000,
            "output_dim": 128,
            "embeddings_initializer": {
              "class_name": "RandomUniform",
              "config": {
                "minval": -0.05,
                "maxval": 0.05,
                "seed": null
              }
            },
            "embeddings_regularizer": null,
            "activity_regularizer": null,
            "embeddings_constraint": null,
            "mask_zero": null,
            "input_length": 500,
            "name": "embedding_Embedding1",
            "trainable": true,
            "batch_input_shape": [
              null,
              500
            ]
          }
        },
        {
          "class_name": "Conv1D",
          "config": {
            "filters": 128,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_constraint": null,
            "kernel_size": [
              5
            ],
            "strides": [
              1
            ],
            "padding": "valid",
            "dilation_rate": [
              1
            ],
            "activation": "relu",
            "use_bias": true,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "activity_regularizer": null,
            "bias_constraint": null,
            "name": "conv1d_Conv1D1",
            "trainable": true
          }
        },
        {
          "class_name": "MaxPooling1D",
          "config": {
            "pool_size": [
              4
            ],
            "padding": "valid",
            "strides": [
              4
            ],
            "name": "max_pooling1d_MaxPooling1D1",
            "trainable": true
          }
        },
        {
          "class_name": "Bidirectional",
          "config": {
            "merge_mode": "concat",
            "layer": {
              "class_name": "LSTM",
              "config": {
                "name": "lstm_LSTM1",
                "trainable": true,
                "units": 64,
                "activation": "tanh",
                "recurrent_activation": "hard_sigmoid",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                    "scale": 1,
                    "mode": "fan_avg",
                    "distribution": "normal",
                    "seed": null
                  }
                },
                "recurrent_initializer": {
                  "class_name": "Orthogonal",
                  "config": {
                    "gain": 1,
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "unit_forget_bias": null,
                "kernel_regularizer": null,
                "recurrent_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "recurrent_constraint": null,
                "bias_constraint": null,
                "dropout": 0,
                "recurrent_dropout": 0,
                "implementation": null,
                "return_sequences": true,
                "return_state": false,
                "go_backwards": false,
                "stateful": false,
                "unroll": false
              }
            },
            "name": "bidirectional_Bidirectional1",
            "trainable": true
          }
        },
        {
          "class_name": "Bidirectional",
          "config": {
            "merge_mode": "concat",
            "layer": {
              "class_name": "LSTM",
              "config": {
                "name": "lstm_LSTM2",
                "trainable": true,
                "units": 32,
                "activation": "tanh",
                "recurrent_activation": "hard_sigmoid",
                "use_bias": true,
                "kernel_initializer": {
                  "class_name": "VarianceScaling",
                  "config": {
                    "scale": 1,
                    "mode": "fan_avg",
                    "distribution": "normal",
                    "seed": null
                  }
                },
                "recurrent_initializer": {
                  "class_name": "Orthogonal",
                  "config": {
                    "gain": 1,
                    "seed": null
                  }
                },
                "bias_initializer": {
                  "class_name": "Zeros",
                  "config": {}
                },
                "unit_forget_bias": null,
                "kernel_regularizer": null,
                "recurrent_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "recurrent_constraint": null,
                "bias_constraint": null,
                "dropout": 0,
                "recurrent_dropout": 0,
                "implementation": null,
                "return_sequences": false,
                "return_state": false,
                "go_backwards": false,
                "stateful": false,
                "unroll": false
              }
            },
            "name": "bidirectional_Bidirectional2",
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 64,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense1",
            "trainable": true
          }
        },
        {
          "class_name": "Dropout",
          "config": {
            "rate": 0.5,
            "noise_shape": null,
            "seed": null,
            "name": "dropout_Dropout1",
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 1,
            "activation": "sigmoid",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense2",
            "trainable": true
          }
        }
      ]
    },
    "keras_version": "tfjs-layers 4.22.0",
    "backend": "tensor_flow.js"
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "embedding_Embedding1/embeddings",
          "shape": [
            10000,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "conv1d_Conv1D1/kernel",
          "shape": [
            5,
            128,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "conv1d_Conv1D1/bias",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_Bidirectional1/forward_lstm_LSTM1/kernel",
          "shape": [
            128,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_Bidirectional1/forward_lstm_LSTM1/recurrent_kernel",
          "shape": [
            64,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_Bidirectional1/forward_lstm_LSTM1/bias",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_Bidirectional1/backward_lstm_LSTM1/kernel",
          "shape": [
            128,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_Bidirectional1/backward_lstm_LSTM1/recurrent_kernel",
          "shape": [
            64,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_Bidirectional1/backward_lstm_LSTM1/bias",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_Bidirectional2/forward_lstm_LSTM2/kernel",
          "shape": [
            128,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_Bidirectional2/forward_lstm_LSTM2/recurrent_kernel",
          "shape": [
            32,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_Bidirectional2/forward_lstm_LSTM2/bias",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_Bidirectional2/backward_lstm_LSTM2/kernel",
          "shape": [
            128,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_Bidirectional2/backward_lstm_LSTM2/recurrent_kernel",
          "shape": [
            32,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_Bidirectional2/backward_lstm_LSTM2/bias",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_Dense1/kernel",
          "shape": [
            64,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_Dense1/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_Dense2/kernel",
          "shape": [
            64,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_Dense2/bias",
          "shape": [
            1
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}